---
type: LineLightShape
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 3
tags: [revit-api, class]
---

# LineLightShape

`Autodesk.Revit.DB.Lighting.LineLightShape` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LineLightShape | — | `` |
| Constructor | LineLightShape | 2013 | `public LineLightShape ()` |
| Property | EmitLength | 2013 | `public double EmitLength { get ; set ; }` |